[
  {
    "id": "1740241840481",
    "content": "Today is a sunny Saturday. I woke up at 7:30am my usual time. My first thing was to check my phone to see what time is ,and to turn on the morning meditation recording of Louise Hay. \n\nHowever, today I was shocked and distracted by a news article titled something like “ we need another Manhattan project” . The shock plus fear was so strong that I had to read. The article is indeed advocating for US government investing in nuclear weapon, this time with advanced technology? Are they thinking to make a damage controlled and target specific nuclear weapon? Then even more shocking fact to me: the two people who are proposing this is PLTR, whose stock rose up 300% plus after Trump takes office and DeepSeek announced . So PLTR founded by tech billionaires who deeply support MAGA vision. To me , MAGA is a vision leading the humanity going backwards, meaning world will worship power over humanity,The collection of human 贪 嗔 痴 will be further expanded, which is the opposite direction of why every human being decided to come this earth.\n\nAnyway, this thought is too deep to put in writing . Something that I am\nStill formulating in my head.\n\nThe appearance of DeepSeek gives me hope to this world, . Largely it is probably the only possibility to compete with Elon Musk who claims for the good of all people but in fact maybe just for himself and his own ego. \n\nIf AI approves to be able to think, it will superpower human brain, the philosophy placed in the seed of this AI becomes the only thing that can decide or control what this AI will do, meaning friend human race or harm it. \n\nBased on my limited dialogues with Open AI , DS and Grok3, the “mindset” of them clearly reflect the engineers who built them. Open AI is the most diplomatic, Groks has a strong character of rebellion and I am\nBetter smarter ( using F words and offense tone, which probably not allowed by open AI). The lack of regulation to build such big AI platforms makes human fate vulnerable in the hand of good will of these few tech pioneers.  The open source of DS provided a hope \n\nIt becomes too big again. Com back to my daily life\n\nAfter waking up , read the article and generate millions of different thoughts in my mind with 10 mins, I felt tired again and decided to go back to sleep again this time in living room sofa. I felt into sleep soon .\n\n8:30am a call from sales person of a pest control woke me up. Answered briefly and went back to sleep. Then 10:30 woke up by another phone call. \n\nThen eventually I am awake. I decided find the article about DS has showed how it able to think independently of human teaching. I then read everything from this author and found this easy way to write 碎片想法easily and can turn into blog effortlessly in the future, and it is completely open source and free and not worried about losing data as long as GitHub in business. \n\nSo I created an account and started this first  write. \n\n",
    "timestamp": "2025-02-22T16:30:40.481Z"
  }
]